tutorials/heatTransfer/buoyantBoussinesqPimpleFoam/hotRoom/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

compileApplication ../../buoyantPimpleFoam/hotRoom/setHotRoom
runApplication blockMesh
runApplication setHotRoom
runApplication $application

# ----------------------------------------------------------------- end-of-file
